DataProcessors/ПечатьАктаОбОказанииУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПечатьАктаОбОказанииУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПечатьАктаОбОказанииУслуг/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("СформироватьПФ")
Функция ДоработкиПечатныхФорм_СформироватьПФ(ОписаниеПечатнойФормы, ДанныеОбъектовПечати, ОбъектыПечати, Подробно)
	Перем Ошибки, ПервыйДокумент, НомерСтрокиНачало;

	Макет = УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ТабличныйДокумент = ОписаниеПечатнойФормы.ТабличныйДокумент;
	ДанныеПечати = Новый Структура;
	ПредставлениеСкидки = Константы.ПредставлениеСкидкиВПечатнойФорме.Получить();

	Для Каждого ДанныеОбъекта Из ДанныеОбъектовПечати Цикл

		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало,
		ДанныеПечати);

		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ДанныеОбъекта.Организация,
		ДанныеОбъекта.ДатаДокумента, , );
		СведенияОбКонтрагенте = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ДанныеОбъекта.Контрагент,
		ДанныеОбъекта.ДатаДокумента, , );

#Удаление
		ЛоготипЗаполнен = ЗначениеЗаполнено(ДанныеОбъекта.ФайлЛоготип);
		ИмяМакета = ?(ЛоготипЗаполнен, "ЗаголовокСЛоготипом", "Заголовок");
#КонецУдаления
#Вставка
//+++       Печать Логотипа исключена по условиям работы
		ЛоготипЗаполнен = Ложь;
		ИмяМакета = "Заголовок";

#КонецВставки

		ОбластьЗаголовок = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяМакета, "", Ошибки);
		Если ОбластьЗаголовок <> Неопределено Тогда

			ШаблонЗаголовка = Нстр("ru ='Акт об оказании услуг № %1 от %2'");
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеОбъекта.ДатаДокумента,
			ДанныеОбъекта.Номер, ДанныеОбъекта.Префикс);
			ДанныеПечати.Вставить("ПредставлениеДокумента", СтрШаблон(ШаблонЗаголовка, НомерДокумента, Формат(
			ДанныеОбъекта.ДатаДокумента, "ДЛФ=DD")));

			Если ЛоготипЗаполнен Тогда

				ДанныеКартинки = РаботаСФайлами.ДвоичныеДанныеФайла(ДанныеОбъекта.ФайлЛоготип);
				Если ЗначениеЗаполнено(ДанныеКартинки) Тогда

					ОбластьЗаголовок.Рисунки.Логотип.Картинка = Новый Картинка(ДанныеКартинки);

				КонецЕсли;

			КонецЕсли;

			ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьЗаголовок,
			ДанныеОбъекта.Ссылка);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		КонецЕсли;

		ОбластьПоставщик = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Поставщик", "", Ошибки);
		Если ОбластьПоставщик <> Неопределено Тогда

			ДанныеПечати.Вставить("ПредставлениеПоставщика", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(
			СведенияОбОрганизации, "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
			ДанныеПечати.Вставить("ОснованиеПечати", ДанныеОбъекта.ОснованиеПечати);

			ОбластьПоставщик.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьПоставщик);

		КонецЕсли;

		ОбластьПокупатель = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Покупатель", "", Ошибки);
		Если ОбластьПокупатель <> Неопределено Тогда

			ДанныеПечати.Вставить("ПредставлениеПолучателя", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(
			СведенияОбКонтрагенте, "ПолноеНаименование,ИНН,КПП,РегистрационныйНомер,ЮридическийАдрес,Телефоны,"));

			ОбластьПокупатель.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьПокупатель);

		КонецЕсли;

		ЕстьСкидки = (ДанныеОбъекта.ТаблицаРаботыУслуги.Итог("ЕстьСкидка") <> 0);

		ИмяОбласти = ?(ЕстьСкидки, "ШапкаТаблицыСоСкидкой", "ШапкаТаблицы");
		ОбластьШапкаТаблицы = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
		Если ОбластьШапкаТаблицы <> Неопределено Тогда

			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

		КонецЕсли;

		ИмяОбласти = ?(ЕстьСкидки, "СтрокаСоСкидкой", "Строка");
		ОбластьСтрока = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, "", Ошибки);
		Если ОбластьСтрока <> Неопределено Тогда

			Итоги = Новый Структура;
			Итоги.Вставить("Сумма", 0);
			Итоги.Вставить("СуммаНДС", 0);
			Итоги.Вставить("Всего", 0);
			Итоги.Вставить("Количество", 0);
			Итоги.Вставить("НомерСтроки", 0);
			Итоги.Вставить("ПредставлениеСкидки", ПредставлениеСкидки);
			Итоги.Вставить("ЕстьСкидки", ЕстьСкидки);
			Итоги.Вставить("Подробно", Подробно);
			Итоги.Вставить("ЕстьСтавкаНольПроцентов", Ложь);

			// Наборы
			Итоги.Вставить("ЕстьНаборы", ДанныеОбъекта.ТаблицаРаботыУслуги.Колонки.Найти("НоменклатураНабора")
			<> Неопределено);
			Если Итоги.ЕстьНаборы Тогда
				// Наборы неподходящего типа разворачиваем до составляющих
				РазвернутьНабор = Ложь;
				Для Каждого СтрокаРаботыУслуги Из ДанныеОбъекта.ТаблицаРаботыУслуги Цикл
					Если СтрокаРаботыУслуги.ЭтоНабор И СтрокаРаботыУслуги.ТипНоменклатуры
						<> Перечисления.ТипыНоменклатуры.Услуга И СтрокаРаботыУслуги.ТипНоменклатуры
						<> Перечисления.ТипыНоменклатуры.Работа Тогда
						РазвернутьНабор = Истина;
						Продолжить;
					КонецЕсли;
					Если РазвернутьНабор И Не ЗначениеЗаполнено(СтрокаРаботыУслуги.НоменклатураНабора) Тогда
						РазвернутьНабор = Ложь;
					КонецЕсли;
					Если РазвернутьНабор Тогда
						СтрокаРаботыУслуги.НоменклатураНабора = Неопределено;
						СтрокаРаботыУслуги.ХарактеристикаНабора = Неопределено;
						СтрокаРаботыУслуги.НеобходимоВыделитьКакСоставНабора = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли; 
			// Конец Наборы

			ПараметрыНоменклатуры = Новый Структура;

			Для Каждого СтрокаРаботыУслуги Из ДанныеОбъекта.ТаблицаРаботыУслуги Цикл

				Если СтрокаРаботыУслуги.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга
					И СтрокаРаботыУслуги.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа Тогда

					Продолжить;

				КонецЕсли;

				ЗаполнитьДанныеПечатиПоСтрокеТабличнойЧасти(СтрокаРаботыУслуги, ДанныеПечати, ПараметрыНоменклатуры,
				Итоги);
				ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьСтрока);

				// Наборы
				Если Итоги.ЕстьНаборы Тогда
					НаборыСервер.УчестьОформлениеСтрокиНабора(ТабличныйДокумент, ОбластьСтрока, СтрокаРаботыУслуги);
				КонецЕсли;
				// Конец Наборы

			КонецЦикла;

		КонецЕсли;

		ОбластьИтого = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "Итого", "", Ошибки);
		Если ОбластьИтого <> Неопределено Тогда

			ДанныеПечати.Вставить("Всего", УправлениеНебольшойФирмойСервер.ФорматСумм(Итоги.Сумма));
			ДанныеПечати.Вставить("ЗаголовокНДС", ПечатьДокументовУНФ.ПредставлениеЗаголовкаНДС(
			Итоги.СуммаНДС, ДанныеОбъекта.СуммаВключаетНДС, Ложь,
			Итоги.ЕстьСтавкаНольПроцентов));
			ДанныеПечати.Вставить("ВсегоНДС", ?(Итоги.СуммаНДС = 0
			И Не Итоги.ЕстьСтавкаНольПроцентов, "-", УправлениеНебольшойФирмойСервер.ФорматСумм(
			Итоги.СуммаНДС, , "0,00")));

			ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьИтого);

		КонецЕсли;

		ОбластьСуммаПрописью = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, "СуммаПрописью", "", Ошибки);
		Если ОбластьСуммаПрописью <> Неопределено Тогда

			ШаблонИтоговойСтроки = НСтр("ru ='Всего наименований %1, на сумму %2'");
			ДанныеПечати.Вставить("ИтоговаяСтрока", СтрШаблон(ШаблонИтоговойСтроки, Строка(Итоги.Количество),
			УправлениеНебольшойФирмойСервер.ФорматСумм(Итоги.Всего, ДанныеОбъекта.ВалютаДокумента)));
			ДанныеПечати.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(Итоги.Всего,
			ДанныеОбъекта.ВалютаДокумента));
			ОбластьСуммаПрописью.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);

		КонецЕсли;

#Удаление
		ИмяОбласти = ?(ДанныеОбъекта.ИспользоватьФаксимиле = Перечисления.ДаНет.Да, "ПодписиСФаксимиле",
		"ПодписиБезФаксимиле");
		ОбластьПодписи = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(Макет, ИмяОбласти, , Ошибки);
		Если ОбластьПодписи <> Неопределено Тогда
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
		МакетДополение = ПолучитьМакет("ПФ_MXL_АктОбОказанииУслуг_Подписи");
		ИмяОбласти = "ПодписиБезФаксимиле";
		ОбластьПодписи = ПечатьДокументовУНФ.ПолучитьОбластьБезопасно(МакетДополение, ИмяОбласти, , Ошибки);
		Если ОбластьПодписи <> Неопределено Тогда

#КонецВставки

			ОбластьПодписи.Параметры.Заполнить(ДанныеОбъекта);

			Если ДанныеОбъекта.ИспользоватьФаксимиле = Перечисления.ДаНет.Да Тогда

				ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
				ПодписиИФаксимиле.Вставить("ПодписьРуководителя", "ФаксимилеРуководителя");
				ПодписиИФаксимиле.Вставить("ПечатьОрганизации", "ФаксимилеПечати");

				ПодписьДокументовУНФ.ЗаполнитьФаксимилеВОбластиМакета(ОбластьПодписи, ДанныеОбъекта, ПодписиИФаксимиле,
				Ошибки);

			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьПодписи);

		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
		ДанныеОбъекта.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции
